In [1]:
# SQL alchemy
from sqlalchemy import create_engine

from config import pswd

# PyMySQL
import pymysql
pymysql.install_as_MySQLdb()

In [2]:
# engine = create_engine("mysql://<Username>:<Password>@localhost/sportsdb")
engine = create_engine("mysql://root:{}@localhost:3306/ice_cream_db".format(pswd))

In [5]:
data = engine.execute("SELECT * FROM flavors where price > 1.25;")

for record in data:
    print(record)

('Banana', 80, Decimal('2.50'))
('Green tea', 100, Decimal('2.50'))
('Chololate', 70, Decimal('2.75'))

In [8]:
import pandas as pd

sql = "SELECT * FROM flavors where price > 1.25;"
df = pd.read_sql(sql,engine)
df

      flavor  rating  price
0     Banana      80   2.50
1  Green tea     100   2.50
2  Chololate      70   2.75